# Define the Earthly Branches
DI_ZHI = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥']

# Define the palace names in counter-clockwise order
PALACE_NAME = ['命宮', '兄弟宮', '夫妻宮', '子女宮', '財帛宮', '疾厄宮', '遷移宮', '僕役宮', '官祿宮', '田宅宮', '福德宮', '父母宮']

# --- Define the Heavenly Stems ---
TIAN_GAN = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸']

# --- 天府位置字典 ---
TIAN_FU_POSITION = {
    "子": "辰", "丑": "卯", "寅": "寅", "卯": "丑", "辰": "子",
    "巳": "亥", "午": "戌", "未": "酉", "申": "申", "酉": "未",
    "戌": "午", "亥": "巳"
}
# --- 五行局 查表 ---
WSJ_DICT = {
    "甲己": {"子丑":"水二局","寅卯":"火六局","辰巳":"木三局","午未":"土五局","申酉":"金四局","戌亥":"火六局"},
    "乙庚": {"子丑":"火六局","寅卯":"土五局","辰巳":"金四局","午未":"木三局","申酉":"水二局","戌亥":"土五局"},
    "丙辛": {"子丑":"土五局","寅卯":"木三局","辰巳":"水二局","午未":"金四局","申酉":"火六局","戌亥":"木三局"},
    "丁壬": {"子丑":"木三局","寅卯":"金四局","辰巳":"火六局","午未":"水二局","申酉":"土五局","戌亥":"金四局"},
    "戊癸": {"子丑":"金四局","寅卯":"水二局","辰巳":"土五局","午未":"火六局","申酉":"木三局","戌亥":"水二局"},
}
WUXING_JU_MAP = {
    "水二局": 0,
    "木三局": 1,
    "金四局": 2,
    "土五局": 3,
    "火六局": 4
}
    # row 農曆生日 day
LUNAR_DAY_TABLE = [
    ["丑", "辰", "亥", "午", "酉"],
    ["寅", "丑", "辰", "亥", "午"],
    ["寅", "未", "丑", "辰", "亥"],
    ["卯", "巳", "寅", "丑", "辰"],
    ["卯", "寅", "子", "寅", "丑"],
    ["辰", "卯", "巳", "未", "寅"],
    ["辰", "午", "寅", "子", "戌"],
    ["巳", "卯", "卯", "巳", "未"],
    ["巳", "卯", "丑", "寅", "子"],
    ["午", "未", "午", "卯", "巳"],
    ["午", "辰", "卯", "申", "寅"],
    ["未", "巳", "亥", "丑", "卯"],
    ["未", "申", "寅", "午", "亥"],
    ["申", "巳", "未", "卯", "申"],
    ["申", "午", "辰", "辰", "丑"],
    ["酉", "酉", "子", "酉", "午"],
    ["酉", "午", "卯", "寅", "卯"],
    ["戌", "未", "申", "未", "辰"],
    ["戌", "戌", "巳", "辰", "子"],
    ["亥", "未", "午", "巳", "酉"],
    ["亥", "申", "丑", "戌", "寅"],
    ["子", "未", "酉", "卯", "未"],
    ["子", "申", "午", "申", "辰"],
    ["丑", "酉", "未", "巳", "巳"],
    ["丑", "子", "巳", "午", "丑"],
    ["寅", "酉", "戌", "亥", "戌"],
    ["寅", "戌", "未", "辰", "卯"],
    ["卯", "丑", "申", "酉", "申"],
    ["卯", "戌", "午", "午", "巳"],
    ["辰", "寅", "亥", "未", "午"]
]

# 4 化
FOUR_HUA = ["祿", "權", "科", "忌"]
HUA_DICT = {
    "甲": ["廉貞", "破軍", "武曲", "太陽"],
    "乙": ["天機", "天梁", "紫微", "太陰"],
    "丙": ["天同", "天機", "文昌", "廉貞"],
    "丁": ["太陰", "天同", "天機", "巨門"],
    "戊": ["貪狼", "太陰", "右弼", "天機"],
    "己": ["武曲", "貪狼", "天梁", "文曲"],
    "庚": ["太陽", "武曲", "太陰", "天同"],
    "辛": ["巨門", "太陽", "文曲", "文昌"],
    "壬": ["天梁", "紫微", "左輔", "武曲"],
    "癸": ["破軍", "巨門", "太陰", "貪狼"]
}

class ZiWeiConfig:
    def __init__(self, year:int, month:int, day:int, hour:int, is_male:bool=True, is_lunar:bool = False):
        self.year = year
        self.month = month
        self.day = day
        self.hour = hour
        self.is_male = is_male
        self.is_lunar = is_lunar
        self.year_of_tian_gan_di_zhi = ""
        self.hour_of_di_zhi = ""

